ws/resources/objectRepo/xmlTemplates/RSV/Reservation/req_FetchReservation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/rsv/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:FetchReservationRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:Criteria HotelCode="?" MarkAsRecentlyAccessed="?">
            <v91:ReservationID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
            <v91:FetchInstructions>
               <v91:FetchInstruction/>
            </v91:FetchInstructions>
            <v91:AllowedActions>
               <v91:AllowedAction/>
            </v91:AllowedActions>
         </v9:Criteria>
         <v9:ChannelInformation RetransmissionIndicator="?">
            <v91:ChannelSummaryInfo MessageID="?" SummaryOnly="?">
               <v91:BookingChannel ChannelCode="?" ChannelName="?" ChannelType="?"/>
            </v91:ChannelSummaryInfo>
            <v91:LinkedConfirmationNumber ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
            <v91:ChannelResvAction/>
         </v9:ChannelInformation>
      </v9:FetchReservationRQ>
   </soapenv:Body>
</soapenv:Envelope>